# DataFrames

## Overview

In [3]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2]}
df = pd.DataFrame(dic)
df

      name  children
0    Livio         0
1    Marco         1
2  Lorenzo         2

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
name        3 non-null object
children    3 non-null int64
dtypes: int64(1), object(1)
memory usage: 128.0+ bytes

In [5]:
df.columns

Index(['name', 'children'], dtype='object')

## Estrazione Colonne

In [7]:
df.name

0      Livio
1      Marco
2    Lorenzo
Name: name, dtype: object

In [8]:
df["children"]

0    0
1    1
2    2
Name: children, dtype: int64

In [9]:
df.describe()

       children
count       3.0
mean        1.0
std         1.0
min         0.0
25%         0.5
50%         1.0
75%         1.5
max         2.0

In [12]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2],
        "free_time" : [1000, 100, 10]}
df = pd.DataFrame(dic)
df.describe()

       children    free_time
count       3.0     3.000000
mean        1.0   370.000000
std         1.0   547.448628
min         0.0    10.000000
25%         0.5    55.000000
50%         1.0   100.000000
75%         1.5   550.000000
max         2.0  1000.000000

In [6]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2]}
df = pd.DataFrame(dic)
df['month'] =  ['Sept', 'Oct', 'Dec']
df

      name  children month
0    Livio         0  Sept
1    Marco         1   Oct
2  Lorenzo         2   Dec

In [9]:
df['month'] = pd.Series(['Sept', 'Oct', 'Dec'], index=[4,-1,2])
df

      name  children month
0    Livio         0   NaN
1    Marco         1   NaN
2  Lorenzo         2   Dec

In [10]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2]}
df = pd.DataFrame(dic)
df['year'] = '1981'
df

      name  children  year
0    Livio         0  1981
1    Marco         1  1981
2  Lorenzo         2  1981

In [19]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2],
       "year": [1981, 1981, 1981],
       'month': ['Sept', 'Oct', 'Dec']
      }
df = pd.DataFrame(dic)
df[['month', 'year']]

  month  year
0  Sept  1981
1   Oct  1981
2   Dec  1981

In [23]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2],
       "year": [1981, 1981, 1981],
       'month': ['Sept', 'Oct', 'Dec']
      }
df = pd.DataFrame(dic)
df.pop('month')

0    Sept
1     Oct
2     Dec
Name: month, dtype: object

In [26]:
import pandas as pd
list = [{ "name": "Livio","children": 0},
        { "name": "Marco","children": 1},
        { "name": "Lorenzo","children": 2, 'year': '1981'}]
df = pd.DataFrame(list)
df

   children     name  year
0         0    Livio   NaN
1         1    Marco   NaN
2         2  Lorenzo  1981

In [39]:
import json
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2],
       "year": [1981, 1981, 1981],
       'month': ['Sept', 'Oct', 'Dec']
      }
json_col = json.dumps(dic)
print(type(json_col))
json_col

<class 'str'>

'{"name": ["Livio", "Marco", "Lorenzo"], "children": [0, 1, 2], "year": [1981, 1981, 1981], "month": ["Sept", "Oct", "Dec"]}'

In [40]:
json_col = """{ "name": ["Livio", "Marco", "Lorenzo"], 
    "children": [0, 1, 2],  "year": [1981, 1981, 1981], 
    "month": ["Sept", "Oct", "Dec"]}"""
df = pd.read_json(json_col)
df

      name  children  year month
0    Livio         0  1981  Sept
1    Marco         1  1981   Oct
2  Lorenzo         2  1981   Dec

In [42]:
df = pd.read_csv("./course_resources/LML_Dataframe.csv")
df

      name  children
0    livio         0
1    marco         1
2  lorenzo         2

## Varie

In [8]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2]
      }
df = pd.DataFrame(dic)
dfCopy = df.copy(deep=False) 
dfCopy

      name  children
0    Livio         0
1    Marco         1
2  Lorenzo         2

In [11]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2]
      }
df = pd.DataFrame(dic)
df.rename(columns={'name': "firstName", 'children': 'childrenNumber'})

  firstName  childrenNumber
0     Livio               0
1     Marco               1
2   Lorenzo               2

In [12]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2],
       "year": [1981, 1981, 1981],
       'month': ['Sept', 'Oct', 'Dec']
      }
df = pd.DataFrame(dic)
df.set_index("name")

         children  year month
name
Livio           0  1981  Sept
Marco           1  1981   Oct
Lorenzo         2  1981   Dec

# Algebra

## Selection

In [2]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2],
       "year": [1981, 1981, 1981],
       'month': ['Sept', 'Oct', 'Dec']
      }
df = pd.DataFrame(dic)
df[df.name == 'Livio']

    name  children  year month
0  Livio         0  1981  Sept

In [45]:
df[df.name.str.contains('L')]

      name  children  year month
0    Livio         0  1981  Sept
2  Lorenzo         2  1981   Dec

In [47]:
df[ (df.name.str.contains('L')) & (df.children > 0)]

      name  children  year month
2  Lorenzo         2  1981   Dec

In [4]:
#requires library "numexpr"
df.query('name == "Livio" and children < 3')

    name  children  year month
0  Livio         0  1981  Sept

In [2]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2],
       "year": [1981, 1981, 1981],
       'month': ['Sept', 'Oct', 'Dec']
      }
df = pd.DataFrame(dic)
df.head(2)

    name  children  year month
0  Livio         0  1981  Sept
1  Marco         1  1981   Oct

In [3]:
df.tail(2)

      name  children  year month
1    Marco         1  1981   Oct
2  Lorenzo         2  1981   Dec

In [6]:
df.iloc[[2, 0]]

      name  children  year month
2  Lorenzo         2  1981   Dec
0    Livio         0  1981  Sept

In [12]:
df[-2:]

      name  children  year month
1    Marco         1  1981   Oct
2  Lorenzo         2  1981   Dec

## Projection

In [20]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2],
       "year": [1981, 1981, 1981],
       'month': ['Sept', 'Oct', 'Dec']
      }
df = pd.DataFrame(dic)
#tutte le righe, le ultime 2 colonne
df.iloc[:,-2:]

   year month
0  1981  Sept
1  1981   Oct
2  1981   Dec

In [22]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2],
       "year": [1981, 1981, 1981],
       'month': ['Sept', 'Oct', 'Dec']
      }
df = pd.DataFrame(dic)
df.loc[df.children > 0, ['name', 'year']]

      name  year
1    Marco  1981
2  Lorenzo  1981

      name  year
1    Marco  1981
2  Lorenzo  1981

## Product

In [2]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2],
       'month': ['Sept', 'Oct', 'Dec']
      }
df = pd.DataFrame(dic)
role = pd.DataFrame([{"name": "Livio", "class": "master"},
                    {"name": "Marco", "class" : "cleric"}]) 
df.merge(role, on='name')

    name  children month   class
0  Livio         0  Sept  master
1  Marco         1   Oct  cleric

In [26]:
df.merge(role, how='left')

      name  children month   class
0    Livio         0  Sept  master
1    Marco         1   Oct  cleric
2  Lorenzo         2   Dec     NaN

## Union

In [14]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       'month': ['Sept', 'Oct', 'Dec']
      }
df = pd.DataFrame(dic)
pd.concat([df, df]).reset_index()

   index     name month
0      0    Livio  Sept
1      1    Marco   Oct
2      2  Lorenzo   Dec
3      0    Livio  Sept
4      1    Marco   Oct
5      2  Lorenzo   Dec

In [15]:
df.append(df, ignore_index=True)

      name month
0    Livio  Sept
1    Marco   Oct
2  Lorenzo   Dec
3    Livio  Sept
4    Marco   Oct
5  Lorenzo   Dec

## Difference

In [23]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "children": [0, 1, 2],
       'month': ['Sept', 'Oct', 'Dec']
      }
df = pd.DataFrame(dic)
role = pd.DataFrame([{"name": "Livio", "class": "master"},
                    {"name": "Marco", "class" : "cleric"}]) 

#nomi di df non presenti in role
mask = ~(df.name.isin(role.name))
df[mask]

      name  children month
2  Lorenzo         2   Dec

## Axes

In [44]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "score": [100, 1, 2],
       'month': ['Sept', 'Oct', 'Dec']
      }
df = pd.DataFrame(dic)
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['name', 'score', 'month'], dtype='object')]

In [45]:
df.axes[0]

RangeIndex(start=0, stop=3, step=1)

In [46]:
df.axes[1]

Index(['name', 'score', 'month'], dtype='object')

In [47]:
df.sort_index(axis=1)

  month     name  score
0  Sept    Livio    100
1   Oct    Marco      1
2   Dec  Lorenzo      2

In [54]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo"],
       "score": [100, 1, 2],
       'month': ['Sept', 'Oct', 'Dec']
      }
df = pd.DataFrame(dic, index = ['A', 'C', 'B'])
df.index.values

array(['A', 'C', 'B'], dtype=object)

In [57]:
df.index.unique()

Index(['A', 'C', 'B'], dtype='object')

In [58]:
df.index.duplicated()

array([False, False, False])

In [86]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo", 'Irene', 'Ilaria', 'Flavia'],
       "settore": ['Informatica', 'Medicale', 'Medicale', 'Medicale', 
                   'Informatica', 'Archivistica'],
       "genere" :['M','M','M','F','F', 'F'],
       "numero" :[ 10, 100, 1000, 10000, 100000, 1000000]
      }
df = pd.DataFrame(dic)
#la categorizzazione non  strettamente necessaria ma  una buona 
# prassi (li memorizza come int64 e risparmia spazio)
df['settore']= df['settore'].astype('category')
df['genere'] = df['genere'].astype('category')

In [85]:
df.groupby(['settore', 'genere']).sum()

                        numero
settore      genere
Archivistica F       1000000.0
             M             NaN
Informatica  F        100000.0
             M            10.0
Medicale     F         10000.0
             M          1100.0

In [120]:
%matplotlib inline
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo", 'Irene', 'Ilaria', 'Flavia'],
       "settore": ['Info', 'Med', 'Med', 'Med', 'Info', 'Arch'],
       "genere" :['M','M','M','F','F', 'F'],
       "numero" :[ 10, 100, 1000, 10000, 100000, 1000000],
       "fattore": (list(range(2, 2*7, 2)))
      }
df = pd.DataFrame(dic)
#la categorizzazione non  strettamente necessaria ma  una buona 
# prassi (li memorizza come int64 e risparmia spazio)
df['settore']= df['settore'].astype('category')
df['genere'] = df['genere'].astype('category')
df.loc[df.settore == 'Med', 'Strumento'] = ['Garza', 'Stetoscopio', 'Cartelletta']
df

      name settore genere   numero  fattore    Strumento
0    Livio    Info      M       10        2          NaN
1    Marco     Med      M      100        4        Garza
2  Lorenzo     Med      M     1000        6  Stetoscopio
3    Irene     Med      F    10000        8  Cartelletta
4   Ilaria    Info      F   100000       10          NaN
5   Flavia    Arch      F  1000000       12          NaN

In [134]:
import pandas as pd
dic = { "name": ["Livio", "Marco", "Lorenzo", 'Irene', 'Ilaria', 'Flavia'],
       "numero" :[ 10, 100, 1000, 10000, 100000, 1000000],
       "fattore": (list(range(2, 2*7, 2)))
      }
df = pd.DataFrame(dic)
df.axes

[RangeIndex(start=0, stop=6, step=1),
 Index(['name', 'numero', 'fattore'], dtype='object')]

In [135]:
def divisione(vals):
    a , b = vals
    return a / b

df[['numero', 'fattore']].apply(divisione, axis=1)

0        5.000000
1       25.000000
2      166.666667
3     1250.000000
4    10000.000000
5    83333.333333
dtype: float64

In [136]:
list(range(1,10, 2))

[1, 3, 5, 7, 9]

In [145]:
c = df[['numero']].apply(lambda x : x/ 10)
    .rename(columns={'numero': 'diviso'}) 
c

     diviso
0       1.0
1      10.0
2     100.0
3    1000.0
4   10000.0
5  100000.0

In [175]:
df[['numero' , 'fattore']].apply(lambda x : x +1)

    numero  fattore
0       11        3
1      101        5
2     1001        7
3    10001        9
4   100001       11
5  1000001       13